<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7a6ee0c684fe740e05364dfe24ca312d0ec845be1563b898ded62e827884923b","plan_job_ref":"Job Plan Airflow DAGs #388 at https://github.com/cal-itp/data-infra/actions/runs/16507416144","plan_out_hash":"42aec36e4441486b1a058aceb2fb860815717257001739e6805267159e5a0c94","plan_hash":"cf0eec6826895259b2bf1df3d375a622622ecea619a6df88df1dccde9e56c232","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9PIwBw==" -> (known after apply)
!~      detect_md5hash      = "4YveP9A7ljqqjg/3Bgs2fw==" -> "different hash"
!~      generation          = 1753321626951090 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4YveP9A7ljqqjg/3Bgs2fw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/_int_gtfs.yaml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "rwMIMA==" -> (known after apply)
!~      detect_md5hash      = "T07Rr8u8NH1CM9p/qlrCBA==" -> "different hash"
!~      generation          = 1749663114904700 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
!~      md5hash             = "T07Rr8u8NH1CM9p/qlrCBA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/gtfs/int_gtfs_rt_vs_sched__stops_served_vehicle_positions.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "gElm9g==" -> (known after apply)
!~      detect_md5hash      = "yDLEGvytnnWa5vUOCwQvEw==" -> "different hash"
!~      generation          = 1749663116270396 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"
!~      md5hash             = "yDLEGvytnnWa5vUOCwQvEw==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_schedule__stop_times_grouped.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_vehicle_locations_path.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "d+JBfA==" -> (known after apply)
!~      detect_md5hash      = "dvuSMtXVHhvZNA9RlS/FIw==" -> "different hash"
!~      generation          = 1752161965968081 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_vehicle_locations_path.sql"
!~      md5hash             = "dvuSMtXVHhvZNA9RlS/FIw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_vehicle_locations_path.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_vehicle_positions_stop_metrics.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "I10dVw==" -> (known after apply)
!~      detect_md5hash      = "baiNu7HaXWOnOXrLIggOVw==" -> "different hash"
!~      generation          = 1753321628807708 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "baiNu7HaXWOnOXrLIggOVw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #388](https://github.com/cal-itp/data-infra/actions/runs/16507416144)